RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl602/std/include/hardware/hbn_reg.h
    /* 0x8 : HBN_TIME_H */
    union {
        struct
        {
            uint32_t hbn_time_h    : 8;  /* [ 7: 0],        r/w,        0x0 */
            uint32_t reserved_8_31 : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } HBN_TIME_H;

    /* 0xC : RTC_TIME_L */
    union {
        struct
        {
            uint32_t rtc_time_latch_l : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } RTC_TIME_L;

    /* 0x10 : RTC_TIME_H */
    union {
        struct
        {
            uint32_t rtc_time_latch_h : 8;  /* [ 7: 0],          r,        0x0 */
            uint32_t reserved_8_30    : 23; /* [30: 8],       rsvd,        0x0 */
            uint32_t rtc_time_latch   : 1;  /* [   31],          w,        0x0 */
        } BF;
        uint32_t WORD;
    } RTC_TIME_H;

    /* 0x14 : HBN_IRQ_MODE */
    union {
        struct
        {
            uint32_t hbn_pin_wakeup_mode : 3; /* [ 2: 0],        r/w,        0x5 */
            uint32_t hbn_pin_wakeup_mask : 2; /* [ 4: 3],        r/w,        0x0 */
            uint32_t reserved_5_7        : 3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t reg_aon_pad_ie_smt  : 1; /* [    8],        r/w,        0x1 */
            uint32_t reserved_9_15       : 7; /* [15: 9],       rsvd,        0x0 */
            uint32_t reg_en_hw_pu_pd     : 1; /* [   16],        r/w,        0x1 */
            uint32_t reserved_17         : 1; /* [   17],       rsvd,        0x0 */
            uint32_t irq_bor_en          : 1; /* [   18],        r/w,        0x0 */
            uint32_t reserved_19         : 1; /* [   19],       rsvd,        0x0 */
            uint32_t irq_acomp0_en       : 2; /* [21:20],        r/w,        0x0 */
            uint32_t irq_acomp1_en       : 2; /* [23:22],        r/w,        0x0 */
            uint32_t pin_wakeup_sel      : 3; /* [26:24],        r/w,        0x3 */
            uint32_t pin_wakeup_en       : 1; /* [   27],        r/w,        0x0 */
            uint32_t reserved_28_31      : 4; /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } HBN_IRQ_MODE;

    /* 0x18 : HBN_IRQ_STAT */
    union {
        struct
        {
            uint32_t irq_stat : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } HBN_IRQ_STAT;

    /* 0x1C : HBN_IRQ_CLR */
    union {
        struct
        {
            uint32_t irq_clr : 32; /* [31: 0],          w,        0x0 */
        } BF;
        uint32_t WORD;
    } HBN_IRQ_CLR;

    /* 0x20 : HBN_PIR_CFG */
    union {
        struct
        {
            uint32_t pir_hpf_sel    : 2;  /* [ 1: 0],        r/w,        0x0 */
            uint32_t pir_lpf_sel    : 1;  /* [    2],        r/w,        0x0 */
            uint32_t reserved_3     : 1;  /* [    3],       rsvd,        0x0 */
            uint32_t pir_dis        : 2;  /* [ 5: 4],        r/w,        0x0 */
            uint32_t reserved_6     : 1;  /* [    6],       rsvd,        0x0 */
            uint32_t pir_en         : 1;  /* [    7],        r/w,        0x0 */
            uint32_t gpadc_cgen     : 1;  /* [    8],        r/w,        0x0 */
            uint32_t gpadc_nosync   : 1;  /* [    9],        r/w,        0x0 */
            uint32_t reserved_10_31 : 22; /* [31:10],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } HBN_PIR_CFG;

    /* 0x24 : HBN_PIR_VTH */
    union {
        struct
        {
            uint32_t pir_vth        : 14; /* [13: 0],        r/w,      0x3ff */
            uint32_t reserved_14_31 : 18; /* [31:14],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } HBN_PIR_VTH;

    /* 0x28 : HBN_PIR_INTERVAL */
    union {
        struct
        {
            uint32_t pir_interval   : 12; /* [11: 0],        r/w,      0xa3d */
            uint32_t reserved_12_31 : 20; /* [31:12],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } HBN_PIR_INTERVAL;

    /* 0x2C : HBN_BOR_CFG */
    union {
        struct
        {
            uint32_t bor_sel       : 1;  /* [    0],        r/w,        0x0 */
            uint32_t bor_vth       : 1;  /* [    1],        r/w,        0x1 */
            uint32_t pu_bor        : 1;  /* [    2],        r/w,        0x0 */
            uint32_t r_bor_out     : 1;  /* [    3],          r,        0x0 */
            uint32_t reserved_4_31 : 28; /* [31: 4],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } HBN_BOR_CFG;

    /* 0x30 : HBN_GLB */
    union {
        struct
        {
            uint32_t hbn_root_clk_sel         : 2;  /* [ 1: 0],        r/w,        0x0 */
            uint32_t hbn_uart_clk_sel         : 1;  /* [    2],        r/w,        0x0 */
            uint32_t hbn_f32k_sel             : 2;  /* [ 4: 3],        r/w,        0x0 */
            uint32_t hbn_pu_rc32k             : 1;  /* [    5],        r/w,        0x1 */
            uint32_t reserved_6_15            : 10; /* [15: 6],       rsvd,        0x0 */
            uint32_t sw_ldo11soc_vout_sel_aon : 4;  /* [19:16],        r/w,        0xa */
            uint32_t reserved_20_23           : 4;  /* [23:20],       rsvd,        0x0 */
            uint32_t sw_ldo11_rt_vout_sel     : 4;  /* [27:24],        r/w,        0xa */
            uint32_t sw_ldo11_aon_vout_sel    : 4;  /* [31:28],        r/w,        0xa */
        } BF;
        uint32_t WORD;
    } HBN_GLB;

    /* 0x34 : HBN_SRAM */
    union {
        struct
        {
            uint32_t reserved_0_5  : 6;  /* [ 5: 0],       rsvd,        0x0 */
            uint32_t retram_ret    : 1;  /* [    6],        r/w,        0x0 */
            uint32_t retram_slp    : 1;  /* [    7],        r/w,        0x0 */
            uint32_t reserved_8_31 : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } HBN_SRAM;

    /* 0x38  reserved */
    uint8_t RESERVED0x38[200];

    /* 0x100 : HBN_RSV0 */
    union {
        struct
        {
            uint32_t HBN_RSV0 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } HBN_RSV0;

